tap "jesseduffield/lazygit"

brew "cmake"
brew "coreutils"
brew "fish", args: ["HEAD"]
brew "fzf"
brew "ripgrep"
brew "gcc"
brew "gh"
brew "git"
brew "htop"
brew "neofetch"
brew "neovim"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "croc"
brew "git-delta"
brew "fd"
brew "lazygit"
brew "mise"
brew "zola"
brew "flyctl"
brew "bacon"
brew "bat"
brew "eza"
brew "mprocs"
brew "zoxide"
brew "starship"
brew "age"
brew "chezmoi"
brew "gum"

cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "1password-cli"
cask "vscodium"
cask "ghostty"

vscode "catppuccin.catppuccin-vsc"
vscode "rust-lang.rust-analyzer"
