brew "cmake"
brew "coreutils"
brew "fish"
brew "fzf"
brew "ripgrep"
brew "gcc"
brew "gh"
brew "git"
brew "htop"
brew "neofetch"
brew "neovim"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "croc"
brew "git-delta"
brew "fd"
brew "mise"
brew "zola"
brew "flyctl"
brew "bacon"
brew "bat"
brew "eza"
brew "mprocs"
brew "zoxide"
brew "starship"
brew "age"
brew "chezmoi"
brew "gum"
brew "helix"
brew "zellij"
brew "sqlite"
brew "jj"
brew "ansible"
brew "typst"

cask "font-hack-nerd-font"
cask "font-iosevka-aile"
cask "1password-cli"
cask "ghostty"
cask "vlc"
