brew "cmake"
brew "coreutils"
brew "fish"
brew "fzf"
brew "ripgrep"
brew "gcc"
brew "gh"
brew "git"
brew "htop"
brew "neofetch"
brew "neovim"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "croc"
brew "git-delta"
brew "fd"
brew "mise"
brew "zola"
brew "flyctl"
brew "bacon"
brew "bat"
brew "eza"
brew "mprocs"
brew "zoxide"
brew "starship"
brew "age"
brew "chezmoi"
brew "gum"
brew "helix"
brew "zellij"
brew "sqlite"
brew "jj"
brew "ansible"
brew "typst"
brew "vivid"
brew "mas"
brew "doctl"
brew "postgresql@17"
brew "pgcli"

cask "font-hack-nerd-font"
cask "font-iosevka-aile"
cask "font-inter"
cask "font-iosevka"
cask "1password-cli"
cask "ghostty"
cask "vlc"
cask "vscodium"

vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "pixl-garden.bongocat"
vscode "esbenp.prettier-vscode"
vscode "rust-lang.rust-analyzer"
vscode "tonybaloney.vscode-pets"
vscode "golang.go"
vscode "redhat.ansible"
vscode "tamasfe.even-better-toml"
vscode "hashicorp.terraform"
vscode "redhat.vscode-yaml"
vscode "ms-python.python"
vscode "streetsidesoftware.code-spell-checker"

mas "Amphetamine", id: 937984704   
